{
    "0": "101. Inception (2010)\nPG-13 | 148 min | Action, Adventure, Sci-Fi\n8.8\nRate\n74 Metascore\nA thief who steals corporate secrets through the use of dream-sharing technology is given the inverse task of planting an idea into the mind of a C.E.O.\nDirector: Christopher Nolan | Stars: Leonardo DiCaprio, Joseph Gordon-Levitt, Ellen Page, Ken Watanabe\nVotes: 1,971,690 | Gross: $292.58M",
    "1": "102. Toy Story 3 (2010)\nG | 103 min | Animation, Adventure, Comedy\n8.3\nRate\n92 Metascore\nThe toys are mistakenly delivered to a day-care center instead of the attic right before Andy leaves for college, and it's up to Woody to convince the other toys that they weren't abandoned and to return home.\nDirector: Lee Unkrich | Stars: Tom Hanks, Tim Allen, Joan Cusack, Ned Beatty\nVotes: 732,437 | Gross: $415.00M",
    "2": "103. The Social Network (2010)\nPG-13 | 120 min | Biography, Drama\n7.7\nRate\n95 Metascore\nAs Harvard student Mark Zuckerberg creates the social networking site that would become known as Facebook, he is sued by the twins who claimed he stole their idea, and by the co-founder who was later squeezed out of the business.\nDirector: David Fincher | Stars: Jesse Eisenberg, Andrew Garfield, Justin Timberlake, Rooney Mara\nVotes: 601,567 | Gross: $96.96M",
    "3": "104. Black Swan (2010)\nR | 108 min | Drama, Thriller\n8\nRate\n79 Metascore\nA committed dancer struggles to maintain her sanity after winning the lead role in a production of Tchaikovsky's \"Swan Lake\".\nDirector: Darren Aronofsky | Stars: Natalie Portman, Mila Kunis, Vincent Cassel, Winona Ryder\nVotes: 680,481 | Gross: $106.95M",
    "4": "105. True Grit (2010)\nPG-13 | 110 min | Drama, Western\n7.6\nRate\n80 Metascore\nA stubborn teenager enlists the help of a tough U.S. Marshal to track down her father's murderer.\nDirectors: Ethan Coen, Joel Coen | Stars: Jeff Bridges, Matt Damon, Hailee Steinfeld, Josh Brolin\nVotes: 300,898 | Gross: $171.24M",
    "5": "106. The King's Speech (2010)\nR | 118 min | Biography, Drama, History\n8\nRate\n88 Metascore\nThe story of King George VI, his impromptu ascension to the throne of the British Empire in 1936, and the speech therapist who helped the unsure monarch overcome his stammer.\nDirector: Tom Hooper | Stars: Colin Firth, Geoffrey Rush, Helena Bonham Carter, Derek Jacobi\nVotes: 623,045 | Gross: $138.80M",
    "6": "107. Kick-Ass (2010)\nR | 117 min | Action, Comedy, Crime\n7.6\nRate\n66 Metascore\nDave Lizewski is an unnoticed high school student and comic book fan who one day decides to become a superhero, even though he has no powers, training or meaningful reason to do so.\nDirector: Matthew Vaughn | Stars: Aaron Taylor-Johnson, Nicolas Cage, Chloë Grace Moretz, Garrett M. Brown\nVotes: 514,832 | Gross: $48.07M",
    "7": "108. Shutter Island (2010)\nR | 138 min | Mystery, Thriller\n8.1\nRate\n63 Metascore\nIn 1954, a U.S. Marshal investigates the disappearance of a murderer who escaped from a hospital for the criminally insane.\nDirector: Martin Scorsese | Stars: Leonardo DiCaprio, Emily Mortimer, Mark Ruffalo, Ben Kingsley\nVotes: 1,081,534 | Gross: $128.01M",
	"8": "109. The Fighter (I) (2010)\nR | 116 min | Biography, Drama, Sport\n 7.8\n  Rate\n 79 Metascore\nBased on the story of Micky Ward, a fledgling boxer who tries to escape the shadow of his more famous but troubled older boxing brother and get his own shot at greatness.\nDirector: David O. Russell | Stars: Mark Wahlberg, Christian Bale, Amy Adams, Melissa Leo\nVotes: 331,105 | Gross: $93.62M",
	"9": "110. 127 Hours (2010)\nR | 94 min | Biography, Drama\n7.6\n  Rate \n82 Metascore\nA mountain climber becomes trapped under a boulder while canyoneering alone near Moab, Utah and resorts to desperate measures in order to survive.\nDirector: Danny Boyle | Stars: James Franco, Amber Tamblyn, Kate Mara, Sean Bott\nVotes: 339,363 | Gross: $18.34M"
}

