{"0": "1. Gladiator (2000)\nR | 155 min | Action, Adventure, Drama\n8.5\nRate\n67 Metascore\nA former Roman General sets out to exact vengeance against the corrupt emperor who murdered his family and sent him into slavery.\nDirector: Ridley Scott | Stars: Russell Crowe, Joaquin Phoenix, Connie Nielsen, Oliver Reed\nVotes: 1,292,635 | Gross: $187.71M\nThe Very Best of 2000\n\nIts hard to argue about this spot with Memento, though I end up with R. Scott's Epic film. C'mon 5 Oscars including Best Picture, 3nd highest rating from imdb.com of 8.4 to 8.6 of Memento and 8.5 of Requiem for a dream though not a lot of critics are fun of it a lot of viewers do....\n\nso hands down to the best epic of the new century!", "1": "2. Memento (2000)\nR | 113 min | Mystery, Thriller\n8.4\nRate\n80 Metascore\nA man with short-term memory loss attempts to track down his wife's murderer.\nDirector: Christopher Nolan | Stars: Guy Pearce, Carrie-Anne Moss, Joe Pantoliano, Mark Boone Junior\nVotes: 1,086,349 | Gross: $25.54M", "2": "3. Crouching Tiger, Hidden Dragon (2000)\nPG-13 | 120 min | Action, Adventure, Fantasy\n7.8\nRate\n94 Metascore\nA young Chinese warrior steals a sword from a famed swordsman and then escapes into a world of romantic adventure with a mysterious man in the frontier of the nation.\nDirector: Ang Lee | Stars: Yun-Fat Chow, Michelle Yeoh, Ziyi Zhang, Chen Chang\nVotes: 247,966 | Gross: $128.08M", "3": "4. Traffic (2000)\nR | 147 min | Crime, Drama, Thriller\n7.6\nRate\n86 Metascore\nA conservative judge is appointed by the President to spearhead America's escalating war against drugs, only to discover that his teenage daughter is a crack addict. Two DEA agents protect an informant. A jailed drug baron's wife attempts to carry on the family business.\nDirector: Steven Soderbergh | Stars: Michael Douglas, Benicio Del Toro, Catherine Zeta-Jones, Jacob Vargas\nVotes: 191,798 | Gross: $124.12M", "4": "5. Almost Famous (2000)\nR | 122 min | Adventure, Comedy, Drama\n7.9\nRate\n90 Metascore\nA high-school boy is given the chance to write a story for Rolling Stone Magazine about an up-and-coming rock band as he accompanies them on their concert tour.\nDirector: Cameron Crowe | Stars: Billy Crudup, Patrick Fugit, Kate Hudson, Frances McDormand\nVotes: 244,792 | Gross: $32.53M", "5": "6. Requiem for a Dream (2000)\nR | 102 min | Drama\n8.3\nRate\n68 Metascore\nThe drug-induced utopias of four Coney Island people are shattered when their addictions run deep.\nDirector: Darren Aronofsky | Stars: Ellen Burstyn, Jared Leto, Jennifer Connelly, Marlon Wayans\nVotes: 740,675 | Gross: $3.64M", "6": "7. Cast Away (2000)\nPG-13 | 143 min | Adventure, Drama, Romance\n7.8\nRate\n73 Metascore\nA FedEx executive undergoes a physical and emotional transformation after crash landing on a deserted island.\nDirector: Robert Zemeckis | Stars: Tom Hanks, Helen Hunt, Paul Sanchez, Lari White\nVotes: 504,139 | Gross: $233.63M", "7": "8. Snatch (2000)\nR | 102 min | Comedy, Crime\n8.3\nRate\n55 Metascore\nUnscrupulous boxing promoters, violent bookmakers, a Russian gangster, incompetent amateur robbers and supposedly Jewish jewelers fight to track down a priceless stolen diamond.\nDirector: Guy Ritchie | Stars: Jason Statham, Brad Pitt, Benicio Del Toro, Dennis Farina\nVotes: 759,186 | Gross: $30.33M", "8": "9. O Brother, Where Art Thou? (2000)\nPG-13 | 107 min | Adventure, Comedy, Crime\n7.7\nRate\n69 Metascore\nIn the deep south during the 1930s, three escaped convicts search for hidden treasure while a relentless lawman pursues them.\nDirectors: Joel Coen, Ethan Coen | Stars: George Clooney, John Turturro, Tim Blake Nelson, John Goodman\nVotes: 276,165 | Gross: $45.51M", "9": "10. X-Men (2000)\nPG-13 | 104 min | Action, Adventure, Sci-Fi\n7.4\nRate\n64 Metascore\nIn a world where mutants (evolved super-powered humans) exist and are discriminated against, two groups form for an inevitable clash: the supremacist Brotherhood, and the pacifist X-Men.\nDirector: Bryan Singer | Stars: Patrick Stewart, Hugh Jackman, Ian McKellen, Famke Janssen\nVotes: 557,966 | Gross: $157.30M", "10": "11. A Beautiful Mind (2001)\nPG-13 | 135 min | Biography, Drama\n8.2\nRate\n72 Metascore\nAfter John Nash, a brilliant but asocial mathematician, accepts secret work in cryptography, his life takes a turn for the nightmarish.\nDirector: Ron Howard | Stars: Russell Crowe, Ed Harris, Jennifer Connelly, Christopher Plummer\nVotes: 818,652 | Gross: $170.74M\nAnother Russel Crowe's film... and rightly deserving of 4 Oscar Awards & Should be five because Crowe didn't win the best actor. This true to life drama is too gripping and real to not be named the very best of 2001.", "11": "12. The Lord of the Rings: The Fellowship of the Ring (2001)\nPG-13 | 178 min | Action, Adventure, Drama\n8.8\nRate\n92 Metascore\nA meek Hobbit from the Shire and eight companions set out on a journey to destroy the powerful One Ring and save Middle-earth from the Dark Lord Sauron.\nDirector: Peter Jackson | Stars: Elijah Wood, Ian McKellen, Orlando Bloom, Sean Bean\nVotes: 1,601,843 | Gross: $315.54M", "12": "13. Black Hawk Down (2001)\nR | 144 min | Drama, History, War\n7.7\nRate\n74 Metascore\n160 elite U.S. soldiers drop into Somalia to capture two top lieutenants of a renegade warlord and find themselves in a desperate battle with a large force of heavily-armed Somalis.\nDirector: Ridley Scott | Stars: Josh Hartnett, Ewan McGregor, Tom Sizemore, Eric Bana\nVotes: 355,183 | Gross: $108.64M", "13": "14. Amélie (2001)\nR | 122 min | Comedy, Romance\n8.3\nRate\n69 Metascore\nAmélie is an innocent and naive girl in Paris with her own sense of justice. She decides to help those around her and, along the way, discovers love.\nDirector: Jean-Pierre Jeunet | Stars: Audrey Tautou, Mathieu Kassovitz, Rufus, Lorella Cravotta\nVotes: 684,593 | Gross: $33.23M", "14": "15. Shrek (2001)\nPG | 90 min | Animation, Adventure, Comedy\n7.8\nRate\n84 Metascore\nA mean lord exiles fairytale creatures to the swamp of a grumpy ogre, who must go on a quest and rescue a princess for the lord in order to get his land back.\nDirectors: Andrew Adamson, Vicky Jenson | Stars: Mike Myers, Eddie Murphy, Cameron Diaz, John Lithgow\nVotes: 594,613 | Gross: $267.67M", "15": "16. Donnie Darko (2001)\nR | 113 min | Drama, Mystery, Sci-Fi\n8\nRate\n88 Metascore\nAfter narrowly escaping a bizarre accident, a troubled teenager is plagued by visions of a man in a large rabbit suit who manipulates him to commit a series of crimes.\nDirector: Richard Kelly | Stars: Jake Gyllenhaal, Jena Malone, Mary McDonnell, Holmes Osborne\nVotes: 723,082 | Gross: $1.48M", "16": "17. Mulholland Drive (2001)\nR | 147 min | Drama, Mystery, Thriller\n8\nRate\n85 Metascore\nAfter a car wreck on the winding Mulholland Drive renders a woman amnesiac, she and a perky Hollywood-hopeful search for clues and answers across Los Angeles in a twisting venture beyond dreams and reality.\nDirector: David Lynch | Stars: Naomi Watts, Laura Harring, Justin Theroux, Jeanne Bates\nVotes: 308,231 | Gross: $7.22M", "17": "18. Training Day (2001)\nR | 122 min | Crime, Drama, Thriller\n7.7\nRate\n69 Metascore\nA rookie cop spends his first day as a Los Angeles narcotics officer with a rogue detective who isn't what he appears to be.\nDirector: Antoine Fuqua | Stars: Denzel Washington, Ethan Hawke, Scott Glenn, Tom Berenger\nVotes: 376,754 | Gross: $76.63M", "18": "19. A.I. Artificial Intelligence (2001)\nPG-13 | 146 min | Drama, Sci-Fi\n7.2\nRate\n65 Metascore\nA highly advanced robotic boy longs to become \"real\" so that he can regain the love of his human mother.\nDirector: Steven Spielberg | Stars: Haley Joel Osment, Jude Law, Frances O'Connor, Sam Robards\nVotes: 284,438 | Gross: $78.62M", "19": "20. Moulin Rouge! (2001)\nPG-13 | 127 min | Drama, Musical, Romance\n7.6\nRate\n66 Metascore\nA poet falls for a beautiful courtesan whom a jealous duke covets.\nDirector: Baz Luhrmann | Stars: Nicole Kidman, Ewan McGregor, John Leguizamo, Jim Broadbent\nVotes: 260,990 | Gross: $57.39M", "20": "21. The Pianist (2002)\nR | 150 min | Biography, Drama, Music\n8.5\nRate\n85 Metascore\nA Polish Jewish musician struggles to survive the destruction of the Warsaw ghetto of World War II.\nDirector: Roman Polanski | Stars: Adrien Brody, Thomas Kretschmann, Frank Finlay, Emilia Fox\nVotes: 697,999 | Gross: $32.57M\nThe best of 2002\n\nMuch more deserving than Chicago to win the Oscars best picture.!\nWon 3 Oscars and a nod to the best pic was not enough to how great this film was.", "21": "22. Catch Me If You Can (2002)\nPG-13 | 141 min | Biography, Crime, Drama\n8.1\nRate\n75 Metascore\nA seasoned FBI agent pursues Frank Abagnale Jr. who, before his 19th birthday, successfully forged millions of dollars' worth of checks while posing as a Pan Am pilot, a doctor, and a legal prosecutor.\nDirector: Steven Spielberg | Stars: Leonardo DiCaprio, Tom Hanks, Christopher Walken, Martin Sheen\nVotes: 786,324 | Gross: $164.62M", "22": "23. The Lord of the Rings: The Two Towers (2002)\nPG-13 | 179 min | Adventure, Drama, Fantasy\n8.7\nRate\n87 Metascore\nWhile Frodo and Sam edge closer to Mordor with the help of the shifty Gollum, the divided fellowship makes a stand against Sauron's new ally, Saruman, and his hordes of Isengard.\nDirector: Peter Jackson | Stars: Elijah Wood, Ian McKellen, Viggo Mortensen, Orlando Bloom\nVotes: 1,434,873 | Gross: $342.55M", "23": "24. Gangs of New York (2002)\nR | 167 min | Crime, Drama\n7.5\nRate\n72 Metascore\nIn 1862, Amsterdam Vallon returns to the Five Points area of New York City seeking revenge against Bill the Butcher, his father's killer.\nDirector: Martin Scorsese | Stars: Leonardo DiCaprio, Cameron Diaz, Daniel Day-Lewis, Jim Broadbent\nVotes: 392,810 | Gross: $77.81M", "24": "25. Hero (2002)\nPG-13 | 120 min | Action, Adventure, History\n7.9\nRate\n85 Metascore\nA defense officer, Nameless, was summoned by the King of Qin regarding his success of terminating three warriors.\nDirector: Yimou Zhang | Stars: Jet Li, Tony Chiu-Wai Leung, Maggie Cheung, Ziyi Zhang\nVotes: 170,999 | Gross: $53.71M", "25": "26. Adaptation. (2002)\nR | 115 min | Comedy, Drama\n7.7\nRate\n83 Metascore\nA lovelorn screenwriter becomes desperate as he tries and fails to adapt 'The Orchid Thief' by Susan Orlean for the screen.\nDirector: Spike Jonze | Stars: Nicolas Cage, Meryl Streep, Chris Cooper, Tilda Swinton\nVotes: 172,126 | Gross: $22.25M", "26": "27. The Bourne Identity (2002)\nPG-13 | 119 min | Action, Mystery, Thriller\n7.9\nRate\n68 Metascore\nA man is picked up by a fishing boat, bullet-riddled and suffering from amnesia, before racing to elude assassins and attempting to regain his memory.\nDirector: Doug Liman | Stars: Franka Potente, Matt Damon, Chris Cooper, Clive Owen\nVotes: 494,867 | Gross: $121.66M", "27": "28. Spider-Man (2002)\nPG-13 | 121 min | Action, Adventure, Sci-Fi\n7.3\nRate\n73 Metascore\nWhen bitten by a genetically modified spider, a nerdy, shy, and awkward high school student gains spider-like abilities that he eventually must use to fight evil as a superhero after tragedy befalls his family.\nDirector: Sam Raimi | Stars: Tobey Maguire, Kirsten Dunst, Willem Dafoe, James Franco\nVotes: 669,892 | Gross: $403.71M", "28": "29. Road to Perdition (2002)\nR | 117 min | Crime, Drama, Thriller\n7.7\nRate\n72 Metascore\nA mob enforcer's son witnesses a murder, forcing him and his father to take to the road, and his father down a path of redemption and revenge.\nDirector: Sam Mendes | Stars: Tom Hanks, Tyler Hoechlin, Rob Maxey, Liam Aiken\nVotes: 240,400 | Gross: $104.45M", "29": "30. Minority Report (2002)\nPG-13 | 145 min | Action, Crime, Mystery\n7.6\nRate\n80 Metascore\nIn a future where a special police unit is able to arrest murderers before they commit their crimes, an officer from that unit is himself accused of a future murder.\nDirector: Steven Spielberg | Stars: Tom Cruise, Colin Farrell, Samantha Morton, Max von Sydow\nVotes: 493,426 | Gross: $132.07M", "30": "31. The Lord of the Rings: The Return of the King (2003)\nPG-13 | 201 min | Adventure, Drama, Fantasy\n8.9\nRate\n94 Metascore\nGandalf and Aragorn lead the World of Men against Sauron's army to draw his gaze from Frodo and Sam as they approach Mount Doom with the One Ring.\nDirector: Peter Jackson | Stars: Elijah Wood, Viggo Mortensen, Ian McKellen, Orlando Bloom\nVotes: 1,588,164 | Gross: $377.85M\nNo question asked! The best film of that year. An epic ending to the the best Trilogy ever.\n\nFYI : it sweeps the Academy Award nigth like no other with 11 Wins of 11 nomination it has!", "31": "32. Finding Nemo (2003)\nG | 100 min | Animation, Adventure, Comedy\n8.1\nRate\n90 Metascore\nAfter his son is captured in the Great Barrier Reef and taken to Sydney, a timid clownfish sets out on a journey to bring him home.\nDirectors: Andrew Stanton, Lee Unkrich | Stars: Albert Brooks, Ellen DeGeneres, Alexander Gould, Willem Dafoe\nVotes: 918,987 | Gross: $380.84M", "32": "33. City of God (2002)\nR | 130 min | Crime, Drama\n8.6\nRate\n79 Metascore\nIn the slums of Rio, two kids' paths diverge as one struggles to become a photographer and the other a kingpin.\nDirectors: Fernando Meirelles, Kátia Lund | Stars: Alexandre Rodrigues, Leandro Firmino, Matheus Nachtergaele, Phellipe Haagensen\nVotes: 679,770 | Gross: $7.56M", "33": "34. Kill Bill: Vol. 1 (2003)\nR | 111 min | Action, Crime, Thriller\n8.1\nRate\n69 Metascore\nAfter awakening from a four-year coma, a former assassin wreaks vengeance on the team of assassins who betrayed her.\nDirector: Quentin Tarantino | Stars: Uma Thurman, David Carradine, Daryl Hannah, Michael Madsen\nVotes: 966,624 | Gross: $70.10M", "34": "35. Oldboy (2003)\nR | 120 min | Action, Drama, Mystery\n8.4\nRate\n77 Metascore\nAfter being kidnapped and imprisoned for fifteen years, Oh Dae-Su is released, only to find that he must find his captor in five days.\nDirector: Chan-wook Park | Stars: Min-sik Choi, Ji-Tae Yoo, Hye-jeong Kang, Dae-han Ji\nVotes: 494,263 | Gross: $0.71M", "35": "36. Mystic River (2003)\nR | 138 min | Crime, Drama, Mystery\n7.9\nRate\n84 Metascore\nThe lives of three men who were childhood friends are shattered when one of them has a family tragedy.\nDirector: Clint Eastwood | Stars: Sean Penn, Tim Robbins, Kevin Bacon, Emmy Rossum\nVotes: 407,675 | Gross: $90.14M", "36": "37. Big Fish (2003)\nPG-13 | 125 min | Adventure, Drama, Fantasy\n8\nRate\n58 Metascore\nA frustrated son tries to determine the fact from fiction in his dying father's life.\nDirector: Tim Burton | Stars: Ewan McGregor, Albert Finney, Billy Crudup, Jessica Lange\nVotes: 404,942 | Gross: $66.26M", "37": "38. Pirates of the Caribbean: The Curse of the Black Pearl (2003)\nPG-13 | 143 min | Action, Adventure, Fantasy\n8\nRate\n63 Metascore\nBlacksmith Will Turner teams up with eccentric pirate \"Captain\" Jack Sparrow to save his love, the governor's daughter, from Jack's former pirate allies, who are now undead.\nDirector: Gore Verbinski | Stars: Johnny Depp, Geoffrey Rush, Orlando Bloom, Keira Knightley\nVotes: 995,180 | Gross: $305.41M", "38": "39. X2: X-Men United (2003)\nPG-13 | 134 min | Action, Sci-Fi, Thriller\n7.4\nRate\n68 Metascore\nWhen anti-mutant Colonel William Stryker kidnaps Professor X and attacks his school, the X-Men must ally with their archenemy Magneto to stop him.\nDirector: Bryan Singer | Stars: Patrick Stewart, Hugh Jackman, Halle Berry, Ian McKellen\nVotes: 500,568 | Gross: $214.95M", "39": "40. Lost in Translation (2003)\nR | 102 min | Comedy, Drama\n7.7\nRate\n89 Metascore\nA faded movie star and a neglected young woman form an unlikely bond after crossing paths in Tokyo.\nDirector: Sofia Coppola | Stars: Bill Murray, Scarlett Johansson, Giovanni Ribisi, Anna Faris\nVotes: 396,937 | Gross: $44.59M", "40": "41. Eternal Sunshine of the Spotless Mind (2004)\nR | 108 min | Drama, Romance, Sci-Fi\n8.3\nRate\n89 Metascore\nWhen their relationship turns sour, a couple undergoes a medical procedure to have each other erased from their memories.\nDirector: Michel Gondry | Stars: Jim Carrey, Kate Winslet, Tom Wilkinson, Gerry Robert Byrne\nVotes: 878,742 | Gross: $34.40M\nBest of 2004", "41": "42. Million Dollar Baby (2004)\nPG-13 | 132 min | Drama, Sport\n8.1\nRate\n86 Metascore\nA determined woman works with a hardened boxing trainer to become a professional.\nDirector: Clint Eastwood | Stars: Hilary Swank, Clint Eastwood, Morgan Freeman, Jay Baruchel\nVotes: 616,657 | Gross: $100.49M", "42": "43. The Passion of the Christ (2004)\nR | 127 min | Drama\n7.2\nRate\n47 Metascore\nDepicts the final twelve hours in the life of Jesus of Nazareth, on the day of his crucifixion in Jerusalem.\nDirector: Mel Gibson | Stars: Jim Caviezel, Monica Bellucci, Maia Morgenstern, Christo Jivkov\nVotes: 211,099 | Gross: $370.78M", "43": "44. The Incredibles (2004)\nPG | 115 min | Animation, Action, Adventure\n8\nRate\n90 Metascore\nA family of undercover superheroes, while trying to live the quiet suburban life, are forced into action to save the world.\nDirector: Brad Bird | Stars: Craig T. Nelson, Samuel L. Jackson, Holly Hunter, Jason Lee\nVotes: 636,999 | Gross: $261.44M", "44": "45. The Aviator (2004)\nPG-13 | 170 min | Biography, Drama\n7.5\nRate\n77 Metascore\nA biopic depicting the early years of legendary Director and aviator Howard Hughes' career from the late 1920s to the mid 1940s.\nDirector: Martin Scorsese | Stars: Leonardo DiCaprio, Cate Blanchett, Kate Beckinsale, John C. Reilly\nVotes: 324,065 | Gross: $102.61M", "45": "46. Shrek 2 (2004)\nPG | 93 min | Animation, Adventure, Comedy\n7.2\nRate\n75 Metascore\nShrek and Fiona travel to the Kingdom of Far Far Away, where Fiona's parents are King and Queen, to celebrate their marriage. When they arrive, they find they are not as welcome as they thought they would be.\nDirectors: Andrew Adamson, Kelly Asbury, Conrad Vernon | Stars: Mike Myers, Eddie Murphy, Cameron Diaz, Julie Andrews\nVotes: 406,090 | Gross: $436.47M", "46": "47. Spider-Man 2 (2004)\nPG-13 | 127 min | Action, Adventure, Sci-Fi\n7.3\nRate\n83 Metascore\nPeter Parker is beset with troubles in his failing personal life as he battles a brilliant scientist named Doctor Otto Octavius.\nDirector: Sam Raimi | Stars: Tobey Maguire, Kirsten Dunst, Alfred Molina, James Franco\nVotes: 527,693 | Gross: $373.59M", "47": "48. Shaun of the Dead (2004)\nR | 99 min | Comedy, Horror\n7.9\nRate\n76 Metascore\nA man's uneventful life is disrupted by the zombie apocalypse.\nDirector: Edgar Wright | Stars: Simon Pegg, Nick Frost, Kate Ashfield, Lucy Davis\nVotes: 497,625 | Gross: $13.54M", "48": "49. The Notebook (2004)\nPG-13 | 123 min | Drama, Romance\n7.8\nRate\n53 Metascore\nA poor yet passionate young man falls in love with a rich young woman, giving her a sense of freedom, but they are soon separated because of their social differences.\nDirector: Nick Cassavetes | Stars: Gena Rowlands, James Garner, Rachel McAdams, Ryan Gosling\nVotes: 501,996 | Gross: $81.00M", "49": "50. Sideways (2004)\nR | 127 min | Comedy, Drama, Romance\n7.5\nRate\n94 Metascore\nTwo men reaching middle age with not much to show but disappointment embark on a week-long road trip through California's wine country, just as one is about to take a trip down the aisle.\nDirector: Alexander Payne | Stars: Paul Giamatti, Thomas Haden Church, Virginia Madsen, Sandra Oh\nVotes: 175,687 | Gross: $71.50M", "50": "51. Batman Begins (2005)\nPG-13 | 140 min | Action, Adventure\n8.2\nRate\n70 Metascore\nAfter training with his mentor, Batman begins his fight to free crime-ridden Gotham City from corruption.\nDirector: Christopher Nolan | Stars: Christian Bale, Michael Caine, Ken Watanabe, Liam Neeson\nVotes: 1,264,559 | Gross: $206.85M\nBest of 2005", "51": "52. Munich (2005)\nR | 164 min | Action, Drama, History\n7.5\nRate\n74 Metascore\nBased on the true story of the Black September aftermath, about the five men chosen to eliminate the ones responsible for that fateful day.\nDirector: Steven Spielberg | Stars: Eric Bana, Daniel Craig, Marie-Josée Croze, Ciarán Hinds\nVotes: 206,377 | Gross: $47.40M", "52": "53. Brokeback Mountain (2005)\nR | 134 min | Drama, Romance\n7.7\nRate\n87 Metascore\nThe story of a forbidden and secretive relationship between two cowboys, and their lives over the years.\nDirector: Ang Lee | Stars: Jake Gyllenhaal, Heath Ledger, Michelle Williams, Randy Quaid\nVotes: 314,044 | Gross: $83.04M", "53": "54. A History of Violence (2005)\nR | 96 min | Drama, Thriller\n7.4\nRate\n81 Metascore\nA mild-mannered man becomes a local hero through an act of violence, which sets off repercussions that will shake his family to its very core in this action thriller.\nDirector: David Cronenberg | Stars: Viggo Mortensen, Maria Bello, Ed Harris, William Hurt\nVotes: 218,694 | Gross: $31.49M", "54": "55. Good Night, and Good Luck. (2005)\nPG | 93 min | Biography, Drama, History\n7.4\nRate\n80 Metascore\nBroadcast journalist Edward R. Murrow looks to bring down Senator Joseph McCarthy.\nDirector: George Clooney | Stars: David Strathairn, George Clooney, Patricia Clarkson, Jeff Daniels\nVotes: 92,558 | Gross: $31.50M", "55": "56. Sin City (2005)\nR | 124 min | Crime, Thriller\n8\nRate\n74 Metascore\nA movie that explores the dark and miserable town, Basin City, and tells the story of three different people, all caught up in violent corruption.\nDirectors: Frank Miller, Robert Rodriguez, Quentin Tarantino | Stars: Mickey Rourke, Clive Owen, Bruce Willis, Jessica Alba\nVotes: 730,461 | Gross: $74.10M", "56": "57. King Kong (2005)\nPG-13 | 187 min | Action, Adventure, Drama\n7.2\nRate\n81 Metascore\nA greedy film producer assembles a team of moviemakers and sets out for the infamous Skull Island, where they find more than just cannibalistic natives.\nDirector: Peter Jackson | Stars: Naomi Watts, Jack Black, Adrien Brody, Thomas Kretschmann\nVotes: 381,680 | Gross: $218.08M", "57": "58. Kiss Kiss Bang Bang (2005)\nR | 103 min | Action, Comedy, Crime\n7.5\nRate\n72 Metascore\nA murder mystery brings together a private eye, a struggling actress, and a thief masquerading as an actor.\nDirector: Shane Black | Stars: Robert Downey Jr., Val Kilmer, Michelle Monaghan, Corbin Bernsen\nVotes: 209,646 | Gross: $4.24M", "58": "59. The 40-Year-Old Virgin (2005)\nR | 116 min | Comedy, Romance\n7.1\nRate\n73 Metascore\nGoaded by his buddies, a nerdy guy who's never \"done the deed\" only finds the pressure mounting when he meets a single mother.\nDirector: Judd Apatow | Stars: Steve Carell, Catherine Keener, Paul Rudd, Romany Malco\nVotes: 382,388 | Gross: $109.45M", "59": "60. Mr. & Mrs. Smith (2005)\nPG-13 | 120 min | Action, Comedy, Crime\n6.5\nRate\n55 Metascore\nA bored married couple is surprised to learn that they are both assassins hired by competing agencies to kill each other.\nDirector: Doug Liman | Stars: Brad Pitt, Angelina Jolie, Adam Brody, Vince Vaughn\nVotes: 438,554 | Gross: $186.34M", "60": "61. The Departed (2006)\nR | 151 min | Crime, Drama, Thriller\n8.5\nRate\n85 Metascore\nAn undercover cop and a mole in the police attempt to identify each other while infiltrating an Irish gang in South Boston.\nDirector: Martin Scorsese | Stars: Leonardo DiCaprio, Matt Damon, Jack Nicholson, Mark Wahlberg\nVotes: 1,145,967 | Gross: $132.38M\nBest of 2006", "61": "62. Little Miss Sunshine (2006)\nR | 101 min | Comedy, Drama\n7.8\nRate\n80 Metascore\nA family determined to get their young daughter into the finals of a beauty pageant take a cross-country trip in their VW bus.\nDirectors: Jonathan Dayton, Valerie Faris | Stars: Steve Carell, Toni Collette, Greg Kinnear, Abigail Breslin\nVotes: 427,752 | Gross: $59.89M", "62": "63. Blood Diamond (2006)\nR | 143 min | Adventure, Drama, Thriller\n8\nRate\n64 Metascore\nA fisherman, a smuggler, and a syndicate of businessmen match wits over the possession of a priceless diamond.\nDirector: Edward Zwick | Stars: Leonardo DiCaprio, Djimon Hounsou, Jennifer Connelly, Kagiso Kuypers\nVotes: 485,030 | Gross: $57.37M", "63": "64. Letters from Iwo Jima (2006)\nR | 141 min | Action, Adventure, Drama\n7.9\nRate\n89 Metascore\nThe story of the battle of Iwo Jima between the United States and Imperial Japan during World War II, as told from the perspective of the Japanese who fought it.\nDirector: Clint Eastwood | Stars: Ken Watanabe, Kazunari Ninomiya, Tsuyoshi Ihara, Ryô Kase\nVotes: 151,064 | Gross: $13.76M", "64": "65. Casino Royale (2006)\nPG-13 | 144 min | Action, Adventure, Thriller\n8\nRate\n80 Metascore\nAfter earning 00 status and a licence to kill, Secret Agent James Bond sets out on his first mission as 007. Bond must defeat a private banker funding terrorists in a high-stakes game of poker at Casino Royale, Montenegro.\nDirector: Martin Campbell | Stars: Daniel Craig, Eva Green, Judi Dench, Jeffrey Wright\nVotes: 565,393 | Gross: $167.45M", "65": "66. Pan's Labyrinth (2006)\nR | 118 min | Drama, Fantasy, War\n8.2\nRate\n98 Metascore\nIn the Falangist Spain of 1944, the bookish young stepdaughter of a sadistic army officer escapes into an eerie but captivating fantasy world.\nDirector: Guillermo del Toro | Stars: Ivana Baquero, Ariadna Gil, Sergi López, Maribel Verdú\nVotes: 601,263 | Gross: $37.63M", "66": "67. The Prestige (2006)\nPG-13 | 130 min | Drama, Mystery, Sci-Fi\n8.5\nRate\n66 Metascore\nAfter a tragic accident, two stage magicians engage in a battle to create the ultimate illusion while sacrificing everything they have to outwit each other.\nDirector: Christopher Nolan | Stars: Christian Bale, Hugh Jackman, Scarlett Johansson, Michael Caine\nVotes: 1,139,055 | Gross: $53.09M", "67": "68. The Pursuit of Happyness (2006)\nPG-13 | 117 min | Biography, Drama\n8\nRate\n64 Metascore\nA struggling salesman takes custody of his son as he's poised to begin a life-changing professional career.\nDirector: Gabriele Muccino | Stars: Will Smith, Thandie Newton, Jaden Smith, Brian Howe\nVotes: 431,536 | Gross: $163.57M", "68": "69. V for Vendetta (2005)\nR | 132 min | Action, Drama, Sci-Fi\n8.2\nRate\n62 Metascore\nIn a future British tyranny, a shadowy freedom fighter, known only by the alias of \"V\", plots to overthrow it with the help of a young woman.\nDirector: James McTeigue | Stars: Hugo Weaving, Natalie Portman, Rupert Graves, Stephen Rea\nVotes: 998,782 | Gross: $70.51M", "69": "70. 300 (2006)\nR | 117 min | Action, Drama\n7.6\nRate\n52 Metascore\nKing Leonidas of Sparta and a force of 300 men fight the Persians at Thermopylae in 480 B.C.\nDirector: Zack Snyder | Stars: Gerard Butler, Lena Headey, David Wenham, Dominic West\nVotes: 717,831 | Gross: $210.61M", "70": "71. No Country for Old Men (2007)\nR | 122 min | Crime, Drama, Thriller\n8.1\nRate\n91 Metascore\nViolence and mayhem ensue after a hunter stumbles upon a drug deal gone wrong and more than two million dollars in cash near the Rio Grande.\nDirectors: Ethan Coen, Joel Coen | Stars: Tommy Lee Jones, Javier Bardem, Josh Brolin, Woody Harrelson\nVotes: 818,855 | Gross: $74.28M\nBest of 2007", "71": "72. The Bourne Ultimatum (2007)\nPG-13 | 115 min | Action, Mystery, Thriller\n8\nRate\n85 Metascore\nJason Bourne dodges a ruthless C.I.A. official and his Agents from a new assassination program while searching for the origins of his life as a trained killer.\nDirector: Paul Greengrass | Stars: Matt Damon, Edgar Ramírez, Joan Allen, Julia Stiles\nVotes: 594,406 | Gross: $227.47M", "72": "73. There Will Be Blood (2007)\nR | 158 min | Drama\n8.2\nRate\n93 Metascore\nA story of family, religion, hatred, oil and madness, focusing on a turn-of-the-century prospector in the early days of the business.\nDirector: Paul Thomas Anderson | Stars: Daniel Day-Lewis, Paul Dano, Ciarán Hinds, Martin Stringer\nVotes: 495,828 | Gross: $40.22M", "73": "74. Ratatouille (2007)\nG | 111 min | Animation, Adventure, Comedy\n8\nRate\n96 Metascore\nA rat who can cook makes an unusual alliance with a young kitchen worker at a famous restaurant.\nDirectors: Brad Bird, Jan Pinkava | Stars: Brad Garrett, Lou Romano, Patton Oswalt, Ian Holm\nVotes: 617,930 | Gross: $206.45M", "74": "75. Atonement (2007)\nR | 123 min | Drama, Mystery, Romance\n7.8\nRate\n85 Metascore\nFledgling writer Briony Tallis, as a thirteen-year-old, irrevocably changes the course of several lives when she accuses her older sister's lover of a crime he did not commit.\nDirector: Joe Wright | Stars: Keira Knightley, James McAvoy, Brenda Blethyn, Saoirse Ronan\nVotes: 240,592 | Gross: $50.93M", "75": "76. Juno (2007)\nPG-13 | 96 min | Comedy, Drama\n7.4\nRate\n81 Metascore\nFaced with an unplanned pregnancy, an offbeat young woman makes an unusual decision regarding her unborn child.\nDirector: Jason Reitman | Stars: Ellen Page, Michael Cera, Jennifer Garner, Jason Bateman\nVotes: 480,715 | Gross: $143.50M", "76": "77. American Gangster (2007)\nR | 157 min | Biography, Crime, Drama\n7.8\nRate\n76 Metascore\nAn outcast New York City cop is charged with bringing down Harlem drug lord Frank Lucas, whose real life inspired this partly biographical film.\nDirector: Ridley Scott | Stars: Denzel Washington, Russell Crowe, Chiwetel Ejiofor, Josh Brolin\nVotes: 380,911 | Gross: $130.16M", "77": "78. Into the Wild (2007)\nR | 148 min | Adventure, Biography, Drama\n8.1\nRate\n73 Metascore\nAfter graduating from Emory University, top student and athlete Christopher McCandless abandons his possessions, gives his entire $24,000 savings account to charity and hitchhikes to Alaska to live in the wilderness. Along the way, Christopher encounters a series of characters that shape his life.\nDirector: Sean Penn | Stars: Emile Hirsch, Vince Vaughn, Catherine Keener, Marcia Gay Harden\nVotes: 553,147 | Gross: $18.35M", "78": "79. 3:10 to Yuma (2007)\nR | 122 min | Action, Adventure, Crime\n7.7\nRate\n76 Metascore\nA small-time rancher agrees to hold a captured outlaw who's awaiting a train to go to court in Yuma. A battle of wills ensues as the outlaw tries to psych out the rancher.\nDirector: James Mangold | Stars: Russell Crowe, Christian Bale, Ben Foster, Logan Lerman\nVotes: 281,095 | Gross: $53.61M", "79": "80. Michael Clayton (2007)\nR | 119 min | Crime, Drama, Mystery\n7.2\nRate\n82 Metascore\nA law firm brings in its \"fixer\" to remedy the situation after a lawyer has a breakdown while representing a chemical company that he knows is guilty in a multibillion-dollar class action suit.\nDirector: Tony Gilroy | Stars: George Clooney, Tilda Swinton, Tom Wilkinson, Michael O'Keefe\nVotes: 152,993 | Gross: $49.03M", "80": "81. The Dark Knight (2008)\nPG-13 | 152 min | Action, Crime, Drama\n9\nRate\n84 Metascore\nWhen the menace known as the Joker wreaks havoc and chaos on the people of Gotham, Batman must accept one of the greatest psychological and physical tests of his ability to fight injustice.\nDirector: Christopher Nolan | Stars: Christian Bale, Heath Ledger, Aaron Eckhart, Michael Caine\nVotes: 2,216,454 | Gross: $534.86M\nThe best 2008 and the very best of the decade!!!", "81": "82. Slumdog Millionaire (2008)\nR | 120 min | Drama, Romance\n8\nRate\n84 Metascore\nA Mumbai teenager reflects on his life after being accused of cheating on the Indian version of \"Who Wants to be a Millionaire?\".\nDirectors: Danny Boyle, Loveleen Tandan | Stars: Dev Patel, Freida Pinto, Saurabh Shukla, Anil Kapoor\nVotes: 780,703 | Gross: $141.32M", "82": "83. WALL·E (2008)\nG | 98 min | Animation, Adventure, Family\n8.4\nRate\n95 Metascore\nIn the distant future, a small waste-collecting robot inadvertently embarks on a space journey that will ultimately decide the fate of mankind.\nDirector: Andrew Stanton | Stars: Ben Burtt, Elissa Knight, Jeff Garlin, Fred Willard\nVotes: 964,293 | Gross: $223.81M", "83": "84. Taken (I) (2008)\nPG-13 | 90 min | Action, Thriller\n7.8\nRate\n51 Metascore\nA retired CIA agent travels across Europe and relies on his old skills to save his estranged daughter, who has been kidnapped while on a trip to Paris.\nDirector: Pierre Morel | Stars: Liam Neeson, Maggie Grace, Famke Janssen, Leland Orser\nVotes: 554,717 | Gross: $145.00M", "84": "85. Iron Man (2008)\nPG-13 | 126 min | Action, Adventure, Sci-Fi\n7.9\nRate\n79 Metascore\nAfter being held captive in an Afghan cave, billionaire engineer Tony Stark creates a unique weaponized suit of armor to fight evil.\nDirector: Jon Favreau | Stars: Robert Downey Jr., Gwyneth Paltrow, Terrence Howard, Jeff Bridges\nVotes: 912,959 | Gross: $318.41M", "85": "86. Kung Fu Panda (2008)\nPG | 92 min | Animation, Action, Adventure\n7.5\nRate\n74 Metascore\nThe Dragon Warrior has to clash against the savage Tai Lung as China's fate hangs in the balance. However, the Dragon Warrior mantle is supposedly mistaken to be bestowed upon an obese panda who is a novice in martial arts.\nDirectors: Mark Osborne, John Stevenson | Stars: Jack Black, Ian McShane, Angelina Jolie, Dustin Hoffman\nVotes: 405,258 | Gross: $215.43M", "86": "87. The Wrestler (2008)\nR | 109 min | Drama, Sport\n7.9\nRate\n80 Metascore\nA faded professional wrestler must retire, but finds his quest for a new life outside the ring a dispiriting struggle.\nDirector: Darren Aronofsky | Stars: Mickey Rourke, Marisa Tomei, Evan Rachel Wood, Mark Margolis\nVotes: 284,702 | Gross: $26.24M", "87": "88. Gran Torino (2008)\nR | 116 min | Drama\n8.1\nRate\n72 Metascore\nDisgruntled Korean War veteran Walt Kowalski sets out to reform his neighbor, Thao Lor, a Hmong teenager who tried to steal Kowalski's prized possession: a 1972 Gran Torino.\nDirector: Clint Eastwood | Stars: Clint Eastwood, Bee Vang, Christopher Carley, Ahney Her\nVotes: 701,017 | Gross: $148.10M", "88": "89. Frost/Nixon (2008)\nR | 122 min | Biography, Drama, History\n7.7\nRate\n80 Metascore\nA dramatic retelling of the post-Watergate television interviews between British talk-show host David Frost and former president Richard Nixon.\nDirector: Ron Howard | Stars: Frank Langella, Michael Sheen, Kevin Bacon, Sam Rockwell\nVotes: 100,180 | Gross: $18.59M", "89": "90. The Curious Case of Benjamin Button (2008)\nPG-13 | 166 min | Drama, Fantasy, Romance\n7.8\nRate\n70 Metascore\nTells the story of Benjamin Button, a man who starts aging backwards with consequences.\nDirector: David Fincher | Stars: Brad Pitt, Cate Blanchett, Tilda Swinton, Julia Ormond\nVotes: 569,925 | Gross: $127.51M", "90": "91. Up (2009)\nPG | 96 min | Animation, Adventure, Comedy\n8.2\nRate\n88 Metascore\n78-year-old Carl Fredricksen travels to Paradise Falls in his house equipped with balloons, inadvertently taking a young stowaway.\nDirectors: Pete Docter, Bob Peterson | Stars: Edward Asner, Jordan Nagai, John Ratzenberger, Christopher Plummer\nVotes: 901,501 | Gross: $293.00M\nThe best of 2009", "91": "92. The Hurt Locker (2008)\nR | 131 min | Drama, Thriller, War\n7.6\nRate\n95 Metascore\nDuring the Iraq War, a Sergeant recently assigned to an army bomb squad is put at odds with his squad mates due to his maverick way of handling his work.\nDirector: Kathryn Bigelow | Stars: Jeremy Renner, Anthony Mackie, Brian Geraghty, Guy Pearce\nVotes: 410,664 | Gross: $17.02M", "92": "93. Avatar (2009)\nPG-13 | 162 min | Action, Adventure, Fantasy\n7.8\nRate\n83 Metascore\nA paraplegic Marine dispatched to the moon Pandora on a unique mission becomes torn between following his orders and protecting the world he feels is his home.\nDirector: James Cameron | Stars: Sam Worthington, Zoe Saldana, Sigourney Weaver, Michelle Rodriguez\nVotes: 1,093,629 | Gross: $760.51M", "93": "94. Inglourious Basterds (2009)\nR | 153 min | Adventure, Drama, War\n8.3\nRate\n69 Metascore\nIn Nazi-occupied France during World War II, a plan to assassinate Nazi leaders by a group of Jewish U.S. soldiers coincides with a theatre owner's vengeful plans for the same.\nDirector: Quentin Tarantino | Stars: Brad Pitt, Diane Kruger, Eli Roth, Mélanie Laurent\nVotes: 1,213,637 | Gross: $120.54M", "94": "95. Star Trek (2009)\nPG-13 | 127 min | Action, Adventure, Sci-Fi\n7.9\nRate\n82 Metascore\nThe brash James T. Kirk tries to live up to his father's legacy with Mr. Spock keeping him in check as a vengeful Romulan from the future creates black holes to destroy the Federation one planet at a time.\nDirector: J.J. Abrams | Stars: Chris Pine, Zachary Quinto, Simon Pegg, Leonard Nimoy\nVotes: 569,196 | Gross: $257.73M", "95": "96. The Hangover (2009)\nR | 100 min | Comedy\n7.7\nRate\n73 Metascore\nThree buddies wake up from a bachelor party in Las Vegas, with no memory of the previous night and the bachelor missing. They make their way around the city in order to find their friend before his wedding.\nDirector: Todd Phillips | Stars: Zach Galifianakis, Bradley Cooper, Justin Bartha, Ed Helms\nVotes: 700,185 | Gross: $277.32M", "96": "97. District 9 (2009)\nR | 112 min | Action, Sci-Fi, Thriller\n7.9\nRate\n81 Metascore\nViolence ensues after an extraterrestrial race forced to live in slum-like conditions on Earth finds a kindred spirit in a government agent exposed to their biotechnology.\nDirector: Neill Blomkamp | Stars: Sharlto Copley, David James, Jason Cope, Nathalie Boltt\nVotes: 626,324 | Gross: $115.65M", "97": "98. Up in the Air (I) (2009)\nR | 109 min | Comedy, Drama, Romance\n7.4\nRate\n83 Metascore\nRyan Bingham enjoys living out of a suitcase for his job, travelling around the country firing people, but finds that lifestyle threatened by the presence of a potential love interest, and a new hire.\nDirector: Jason Reitman | Stars: George Clooney, Vera Farmiga, Anna Kendrick, Jason Bateman\nVotes: 311,910 | Gross: $83.82M", "98": "99. 500 Days of Summer (2009)\nPG-13 | 95 min | Comedy, Drama, Romance\n7.7\nRate\n76 Metascore\nAn offbeat romantic comedy about a woman who doesn't believe true love exists, and the young man who falls for her.\nDirector: Marc Webb | Stars: Zooey Deschanel, Joseph Gordon-Levitt, Geoffrey Arend, Chloë Grace Moretz\nVotes: 460,365 | Gross: $32.39M", "99": "100. Sherlock Holmes (2009)\nPG-13 | 128 min | Action, Adventure, Mystery\n7.6\nRate\n57 Metascore\nDetective Sherlock Holmes and his stalwart partner Watson engage in a battle of wits and brawn with a nemesis whose plot is a threat to all of England.\nDirector: Guy Ritchie | Stars: Robert Downey Jr., Jude Law, Rachel McAdams, Mark Strong\nVotes: 570,038 | Gross: $209.03M"}